package com.institution.transfer.constants;

import com.institution.transfer.vo.DimensionMessageVO;

import java.math.BigDecimal;
import java.util.*;
import java.util.concurrent.ConcurrentHashMap;

public final class DimensionCorrespondenceConstants {

    /**
     * 维度映射数据key : ID,value:维度值
     */
    public static Map<String,String> dimensionCorrespondenceMap=new HashMap<>();

    /**
     * 货币资金科目6.0
     */
    public static String[] moneySubjects=new String[]{
            "1001","1002","1003","1011","1012","1012-1","1012-2",
            "1012-3","1012-4","1012-5","1012-6","1012-7","1012-7-1","1012-7-1-1",
            "1012-7-1-1-1","1012-7-1-1-2","1012-7-1-2","1012-7-1-3","1012-7-2","1012-8","1012-7-1-1",
            //新增资金科目1002子科目
            "1002-1","1002-1-1","1002-1-2","1002-1-3","1002-1-4","1002-2","1002-2-1","1002-2-2","1002-2-3",
            "1002-2-4","1002-2-5","1002-2-6","1002-2-7","1002-2-8","1002-2-9","1002-2-10","1002-2-11","1002-2-12",
            "1002-2-13","1002-2-14","1002-2-15","1002-2-16","1002-2-17","1002-2-18","1002-2-19","1002-2-20","1002-2-21",
            "1002-3","1002-3-1","1002-3-2","1002-3-3","1002-3-4","1002-3-5","1002-3-6","1002-3-7","1002-3-8","1002-3-9",
            "1002-3-10","1002-3-11","1002-3-12","1002-3-13","1002-3-14","1002-3-15","1002-4","1002-4-1","1002-4-2","1002-4-3",
            "1002-4-4","1002-4-5","1002-4-6","1002-4-7","1002-4-8","1002-4-9","1002-4-10","1002-4-11","1002-4-12","1002-4-13",
            "1002-4-14","1002-4-15",
    };
    public static List<String> monetaryCapitalSubject= Arrays.asList(moneySubjects);

    /**
     * 凭证号Map
     */
    public static Map<String,String> sexVoucherType=new HashMap<>();


    /**
     * 凭证号Map+Code
     */
    public static Map<String,String> sexVoucherCodeAndType=new HashMap<>();


    /**
     * 查询6.0对应科目编码时需要对应功能范围的SAP科目
     */
    public static String[] functionalScopeSubjects=new String[]{
            "6601010300","6601010400","6601010600","6601010100","6601010500","6601010700","6601010800","6601010901",
            "6601010902","6601010903","6601010904","6601010905","6601010906","6601010907","6601010908","6601012000",
            "6601020100","6601030000","6601040000","6601050000","6601060000","6601070000","6601100000","6601110000",
            "6601120000","6601130000","6601140000","6601150000","6601160000","6601200100","6601200200","6601210000",
            "6601220000","6601230000","6601240000","6601250100","6601250200","6601300100","6601300200","6601300300",
            "6601300400","6601300500","6601310000","6601320000","6601330100","6601330200","6601340000","6601350000",
            "6601360000","6601370100","6601370200","6601370300","6601370400","6601370500","6601370600","6601379900",
            "6601380000","6601390000","6601400000","6601410000","6601420000","6601430000","6601440000","6601450100",
            "6601450200","6601450300","6601460000","6601470000","6601480000","6601490000","6601510000","6601520000",
            "6601530000","6601540000","6601550000","6601560000","6601570000","6601580000","6601590000","6601990000"
    };
    public static List<String> functionalScopeSubject= Arrays.asList(functionalScopeSubjects);

    /**
     *科目对应字典key:SAP科目编码+SAP功能范围 value:6.0科目编码
     */
    public static Map<String,String> subjectAndFunctionalScopeMap=new HashMap<>();

    /**
     *科目维度对应字典key:6.0科目编码 value:6.0维度list
     */
    public static Map<String,List<DimensionMessageVO>> subjectDimensionMap=new HashMap<>();


    /**
     * 查询6.0对应科目编码时需要对应功能范围的SAP科目
     */
    public static String[] dimensionValueGA04=new String[]{
            "6601010300","6601010400","6601010600","6601010100","6601010500","6601010700","6601010800","6601010901",
            "6601010902","6601010903","6601010904","6601010905","6601010906","6601010907","6601010908","6601012000",
            "6601020100","6601030000","6601040000","6601050000","6601060000","6601070000","6601100000","6601110000",
            "6601120000","6601130000","6601140000","6601150000","6601160000","6601200100","6601200200","6601210000",
            "6601220000","6601230000","6601240000","6601250100","6601250200","6601300100","6601300200","6601300300",
            "6601300400","6601300500","6601310000","6601320000","6601330100","6601330200","6601340000","6601350000",
            "6601360000","6601370100","6601370200","6601370300","6601370400","6601370500","6601370600","6601379900",
            "6601380000","6601390000","6601400000","6601410000","6601420000","6601430000","6601440000","6601450100",
            "6601450200","6601450300","6601460000","6601470000","6601480000","6601490000","6601510000","6601520000",
            "6601530000","6601540000","6601550000","6601560000","6601570000","6601580000","6601590000","6601990000",
            "6403010100","6403010200","6403010300","6403010400","6403010500","6403010700","6403010800","6403010900",
            "6403011000","6403011100","6403019900","6403020100","6403020200","6403020300","6403020400","6403020500",
            "6403020600","6403020700","6403020800","6403020900","6403021000","6403021100","6403029900","6603010000",
            "6603020000","6603030000","6603040000","6603050000","6603990000","6701000000","6711010000","6711020000",
            "6711030000","6711040000","6711050000","6711060000","6711990000",
    };
    public static List<String> dimensionValueGA04List= Arrays.asList(dimensionValueGA04);

    /**
     * 6.0科目全路径可key : 6.0科目编码：value :全路径
     */
    public static Map<String,String> sexSubjectFullPathMap=new HashMap<>();

    /**
     * 客户对应关系
     */
    public static Map<String,String> customerCodeComparisonMap=new HashMap<>();

    /**
     * 供应商对应关系
     */
    public static Map<String,String> supplierCodeComparisonMap=new HashMap<>();

    /**
     * 多借多贷的公司代码-凭证号-月份
     */
    public static Set<String> companyCodeVoucherCode=new HashSet<>();

    /**
     * 统计同一凭证同一科目金额加到一起为0得MAP
     */
    public static Map<String, Long> oneVoucherAndOneSubjectAndZeroMap=new ConcurrentHashMap<>();

    /**
     * 摘要为空得数量
     */
    public static Long textValueNums=0L;


    /**
     * 账簿对应的客商数据客商###账簿
     */
    public static Set<String> sapMerchantsAndSexCompanyNameMap=new HashSet<>();


    /**
     * 不能导入凭证编号1001与1002----SAP公司编码+凭证号
     */
    public static Set<String> conditionOneDataSet=new HashSet<>();

    /**
     * 需要拆分的凭证条数
     */
    public static Long screenVoucherNums=0L;

    /**
     * 需要转换名称的客商名称key:旧客商名称；value:需要转换的客商名称
     */
    public static Map<String,String> merchantsConversionMap=new HashMap<>();


}
